org/2015-04-20-ejemplos-de-series.org
#+title: Ejemplos de series
#+author: 
#+date: 2015-04-20 9:00
   
#+setupfile: opciones.org

#+beamer: \setbeamertemplate{navigation symbols}{}
#+beamer: \setbeamertemplate{items}[circle]
#+beamer: \languagepath{spanish}

#+latex_header: \usepackage{tikz}
#+latex_header: \usepackage{tikz-cd}
#+latex_header: \usepackage{pgfplots}
#+latex_header: \usetikzlibrary{babel}

#+beamer: \tableofcontents

* Ejemplos

** Ejemplo

   - \(g(z)=\sum_{n=1}^{\infty}\frac{z^{n}}{n}\) converge uniformemente en
     \(D_{r}=\overline{D}(0,r)\) para cada \(r<1\).
   - \(g(z)\) converge puntualmente en \(D(0,1)\).
   - \(g(z)\) no converge uniformemente en \(D(0,1)\).

** Ejemplo

   - \(\sum_{n=0}^{\infty}z^{n}\) converge puntualmente a
     \(f(z)=\frac{1}{1-z}\) en \(D=D(0,1)\).
   - La convergencia es absoluta en \(D_{r}=\overline{D}(0,r)\) para
     cada \(r<1\).
   - \(\sum_{n=1}^{\infty}nz^{n-1}=\sum_{n=0}^{\infty}(n+1)z^{n}\)
     converge puntualmente en \(D\) a \(\frac{1}{(1-z)^{2}}\) y
     absolutamente en \(D_{r}=\overline{D}(0,r)\) para cada \(r<1\).

** Logaritmo

*** 							     :B_exampleblock:
    :PROPERTIES:
    :BEAMER_env: exampleblock
    :END:
    \(\sum_{n=1}^{\infty}(-1)^{n-1}\frac{z^{n}}{n}\) converge
     uniformemente a \(\log(1+z)\) en todo disco cerrado centrado en
     el origen contenido en \(D=D(0,1)\).

*** 							    :B_ignoreheading:
    :PROPERTIES:
    :BEAMER_env: ignoreheading
    :END:

    - Sabemos que si \(w=\rho e^{i\theta}\in D(1,1)\), entonces
      \(\mathrm{Log}(w)=\int_{\gamma}\frac{1}{\xi}d\xi=\log
      \rho+i\theta\), donde \(\mathrm{Log}\) es la rama principal del
      logaritmo y \(\gamma\) es cualquier camino contenido en
      \(D(1,1)\) que va de \(1\) a \(w\).
    - Haciendo el cambio de variable \(\xi=\eta+1\), obtenemos que 
      \begin{displaymath}
      \int_{\gamma}\frac{1}{\xi}d\xi=\int_{\beta}\frac{1}{\eta+1}d\eta, 
      \end{displaymath}
      donde \(\beta=\gamma-1\) es un camino de \(0\) a \(w-1\).

** 
   - Tenemos que \(\frac{1}{\eta+1}=1-\eta+\eta^{2}-\eta^{3}+\cdots\)
     uniformemente en discos cerrados contenidos en \(D(0,1)\), por lo
     que:
     \begin{displaymath}
     \mathrm{Log}(w)=\int_{\beta}\frac{1}{\eta+1}d\eta =
     \int_{\beta}(1-\eta+\eta^{2}-\eta^{3}+\cdots)\,d\eta
     \end{displaymath}
   - Lo último es igual a 
     \begin{displaymath}
     \sum_{k=0}^{\infty}(-1)^{k}\int_{\beta}\eta^{k}\,d\eta=
     \sum_{k=0}^{\infty}(-1)^{k}\left.\frac{\eta^{k+1}}{k+1}\right|_{0}^{w-1}.
     \end{displaymath}
   - Lo anterior, resulta ser igual a
     \(\sum_{k=1}^{\infty}(-1)^{k-1}\frac{(w-1)^{k}}{k}\). Sustituyendo
     \(w-1=z\), resulta:
     \begin{displaymath}
     \mathrm{Log}(1+z)=\sum_{n=1}^{\infty}(-1)^{n-1}\frac{z^{n}}{n}.
     \end{displaymath}
     y como en el primer ejemplo, se demuestra la convergencia
     uniforme en \(\overline{D_{r}}\).

** Función \(\zeta\) de Riemann

   - La función
     \begin{displaymath}
     \zeta(z)=\sum_{n=1}^{\infty}\frac{1}{n^{z}}
     \end{displaymath}
     es analítica en \(A=\{z\mid\Re z>1\}\).
   - Tenemos que 
     \begin{displaymath}
     |n^{-z}|=|e^{-z\log n}|=|e^{-x\log n-iy\log n}|=e^{-x\log n}=n^{-x}.
     \end{displaymath}
   - Sea \(B\subseteq A\) un disco cerrado. Sea \(\delta\) la
     distancia entre \(B\) y el complemento de \(A\). Entonces, si
     \(z\in B\), se tiene que \(x\geq 1+\delta\), por lo que
     \(n^{-x}\leq n^{-(1+\delta)}\).
   - Tomando \(M_{n}=n^{-(1+\delta)}\), se obtiene la convergencia
     uniforme de la serie en \(B\).
